// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран

Console.Write("Введите Х: ");
int x = int.Parse(Console.ReadLine());
int i = ;

for (int i - 1; i <- x; i++)
{
    if (i == x)
    {
        Console.Write(i * i);
    }
    Console.Write($"i * i + ");
}
